# IsSecondary Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPConnectorInfo..::..IsSecondary Property
MEPConnectorInfo Class See Also
---
True if this is the secondary connector.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public bool IsSecondary { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsSecondary As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsSecondary {
	bool get ();
}
```

# See Also
MEPConnectorInfo Class
Autodesk.Revit.DB Namespace